import os
import sys
sys.path.insert(0,"../jp_arrow")
import jp_arrow

test_data = {
    'MEIJI': {
        '明元年': '-3250368000.0',
        '明01年': '-3250368000.0',
        '明1年': '-3250368000.0',
        '明１年': '-3250368000.0',
        '明０１年': '-3250368000.0',
        '明治元年': '-3250368000.0',
        '明治1年': '-3250368000.0',
        '明治１年': '-3250368000.0',
        '明治０１年': '-3250368000.0',
        '明治46年': '-1830384000.0',
        '明治元年1月': '-3250368000.0',
        '明治元年1月2日': '-3250281600.0',
        '明治元年1月2日3時45分': '-3250268100.0',
        '明治1年1月2日3時45分': '-3250268100.0',
        '明治元年１月２日３時４５分': '-3250268100.0',
        '明治元年０１月０２日０３時４５分': '-3250268100.0',
        '明治０１年0１月0２日０３時４５分': '-3250268100.0',
        '明治元年1月2日午前3時45分': '-3250268100.0',
        '明治元年1月2日AM3時45分': '-3250268100.0',
        '明治元年1月2日am3時45分': '-3250268100.0',
        '明治元年1月2日午後3時45分': '-3250224900.0',
        '明治元年1月2日PM3時45分': '-3250224900.0',
        '明治元年1月2日pm3時45分': '-3250224900.0',
    },
    'TAISHO': {
        '大元年': '-1830384000.0',
        '大01年': '-1830384000.0',
        '大1年': '-1830384000.0',
        '大０１年': '-1830384000.0',
        '大１年': '-1830384000.0',
        '大正元年': '-1830384000.0',
        '大正1年': '-1830384000.0',
        '大正１年': '-1830384000.0',
        '大正０１年': '-1830384000.0',
        '大正18年': '-1293840000.0',
        '大正元年1月': '-1830384000.0',
        '大正元年1月2日': '-1830297600.0',
        '大正元年1月2日3時45分': '-1830284100.0',
        '大正1年1月2日3時45分': '-1830284100.0',
        '大正元年１月２日３時４５分': '-1830284100.0',
        '大正元年０１月０２日０３時４５分': '-1830284100.0',
        '大正０１年0１月0２日０３時４５分': '-1830284100.0',
        '大正元年1月2日午前3時45分': '-1830284100.0',
        '大正元年1月2日AM3時45分': '-1830284100.0',
        '大正元年1月2日am3時45分': '-1830284100.0',
        '大正元年1月2日午後3時45分': '-1830240900.0',
        '大正元年1月2日PM3時45分': '-1830240900.0',
        '大正元年1月2日pm3時45分': '-1830240900.0',
    },
    'SHOWA': {
        '昭元年': '-1388534400.0',
        '昭01年': '-1388534400.0',
        '昭1年': '-1388534400.0',
        '昭１年': '-1388534400.0',
        '昭０１年': '-1388534400.0',
        '昭和元年': '-1388534400.0',
        '昭和1年': '-1388534400.0',
        '昭和１年': '-1388534400.0',
        '昭和０１年': '-1388534400.0',
        '昭和66年': '662688000.0',
        '昭和元年1月': '-1388534400.0',
        '昭和元年1月2日': '-1388448000.0',
        '昭和元年1月2日3時45分': '-1388434500.0',
        '昭和1年1月2日3時45分': '-1388434500.0',
        '昭和元年１月２日３時４５分': '-1388434500.0',
        '昭和元年０１月０２日０３時４５分': '-1388434500.0',
        '昭和０１年0１月0２日０３時４５分': '-1388434500.0',
        '昭和元年1月2日午前3時45分': '-1388434500.0',
        '昭和元年1月2日AM3時45分': '-1388434500.0',
        '昭和元年1月2日am3時45分': '-1388434500.0',
        '昭和元年1月2日午後3時45分': '-1388391300.0',
        '昭和元年1月2日PM3時45分': '-1388391300.0',
        '昭和元年1月2日pm3時45分': '-1388391300.0',
    },
    'HEISEI': {
        '平元年': '599616000.0',
        '平1年': '599616000.0',
        '平01年': '599616000.0',
        '平１年': '599616000.0',
        '平０１年': '599616000.0',
        '平成元年': '599616000.0',
        '平成1年': '599616000.0',
        '平成１年': '599616000.0',
        '平成０１年': '599616000.0',
        '平成36年': '1704067200.0',
        '平成元年1月': '599616000.0',
        '平成元年1月2日': '599702400.0',
        '平成元年1月2日3時45分': '599715900.0',
        '平成1年1月2日3時45分': '599715900.0',
        '平成元年１月２日３時４５分': '599715900.0',
        '平成元年０１月０２日０３時４５分': '599715900.0',
        '平成０１年0１月0２日０３時４５分': '599715900.0',
        '平成元年1月2日午前3時45分': '599715900.0',
        '平成元年1月2日AM3時45分': '599715900.0',
        '平成元年1月2日am3時45分': '599715900.0',
        '平成元年1月2日午後3時45分': '599759100.0',
        '平成元年1月2日PM3時45分': '599759100.0',
        '平成元年1月2日pm3時45分': '599759100.0',
    },
    'REIWA': {
        '令元年': '1546300800.0',
        '令1年': '1546300800.0',
        '令01年': '1546300800.0',
        '令１年': '1546300800.0',
        '令０１年': '1546300800.0',
        '令和元年': '1546300800.0',
        '令和1年': '1546300800.0',
        '令和１年': '1546300800.0',
        '令和０１年': '1546300800.0',
        '令和30年': '2461449600.0',
        '令和元年1月': '1546300800.0',
        '令和元年1月2日': '1546387200.0',
        '令和元年1月2日3時45分': '1546400700.0',
        '令和1年1月2日3時45分': '1546400700.0',
        '令和元年１月２日３時４５分': '1546400700.0',
        '令和元年０１月０２日０３時４５分': '1546400700.0',
        '令和０１年0１月0２日０３時４５分': '1546400700.0',
        '令和元年1月2日午前3時45分': '1546400700.0',
        '令和元年1月2日AM3時45分': '1546400700.0',
        '令和元年1月2日am3時45分': '1546400700.0',
        '令和元年1月2日午後3時45分': '1546443900.0',
        '令和元年1月2日PM3時45分': '1546443900.0',
        '令和元年1月2日pm3時45分': '1546443900.0',
    },
}

class TestClass:
    def test_meiji(self):
        for data, expect in test_data['MEIJI'].items():
            print(data)
            epoch = jp_arrow.get(data).format('X')
            assert epoch == expect

    def test_taisho(self):
        for data, expect in test_data['TAISHO'].items():
            epoch = jp_arrow.get(data).format('X')
            assert epoch == expect

    def test_showa(self):
        for data, expect in test_data['SHOWA'].items():
            epoch = jp_arrow.get(data).format('X')
            assert epoch == expect

    def test_heisei(self):
        for data, expect in test_data['HEISEI'].items():
            epoch = jp_arrow.get(data).format('X')
            assert epoch == expect

    def test_reiwa(self):
        for data, expect in test_data['REIWA'].items():
            epoch = jp_arrow.get(data).format('X')
            assert epoch == expect
